ARMmbed/mbed-os/targets/TARGET_NORDIC/TARGET_NRF5x/TARGET_SDK_15_0/integration/nrfx/legacy/nrf_drv_uart.h
/**
 * Copyright (c) 2015 - 2018, Nordic Semiconductor ASA
 * 
 * All rights reserved.
 * 
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 * 
 * 1. Redistributions of source code must retain the above copyright notice, this
 *    list of conditions and the following disclaimer.
 * 
 * 2. Redistributions in binary form, except as embedded into a Nordic
 *    Semiconductor ASA integrated circuit in a product or a software update for
 *    such product, must reproduce the above copyright notice, this list of
 *    conditions and the following disclaimer in the documentation and/or other
 *    materials provided with the distribution.
 * 
 * 3. Neither the name of Nordic Semiconductor ASA nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 * 
 * 4. This software, with or without modification, must only be used with a
 *    Nordic Semiconductor ASA integrated circuit.
 * 
 * 5. Any software provided in binary form under this license must not be reverse
 *    engineered, decompiled, modified and/or disassembled.
 * 
 * THIS SOFTWARE IS PROVIDED BY NORDIC SEMICONDUCTOR ASA "AS IS" AND ANY EXPRESS
 * OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
 * OF MERCHANTABILITY, NONINFRINGEMENT, AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
 * GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
 * OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 * 
 */

#ifndef NRF_DRV_UART_H__
#define NRF_DRV_UART_H__

#include <nrfx.h>

// Needed for Mbed
#ifndef UART1_ENABLED
#define UART1_ENABLED 0
#endif

#ifndef UART0_ENABLED
#define UART0_ENABLED 0
#endif

#define UART0_INSTANCE_INDEX 0
#define UART1_INSTANCE_INDEX UART0_ENABLED
#define UART_ENABLED_COUNT UART0_ENABLED + UART1_ENABLED


#if defined(UARTE_PRESENT) && NRFX_CHECK(NRFX_UARTE_ENABLED)
    #define NRF_DRV_UART_WITH_UARTE
#endif
#if defined(UART_PRESENT) && NRFX_CHECK(NRFX_UART_ENABLED)
    #define NRF_DRV_UART_WITH_UART
#endif


#if defined(NRF_DRV_UART_WITH_UARTE)
    #include <nrfx_uarte.h>
    #define NRF_DRV_UART_CREATE_UARTE(id) \
        .uarte = NRFX_UARTE_INSTANCE(id),
#else
    // Compilers (at least the smart ones) will remove the UARTE related code
    // (blocks starting with "if (NRF_DRV_UART_USE_UARTE)") when it is not used,
    // but to perform the compilation they need the following definitions.
    #define nrfx_uarte_init(...)                0
    #define nrfx_uarte_uninit(...)
    #define nrfx_uarte_task_address_get(...)    0
    #define nrfx_uarte_event_address_get(...)   0
    #define nrfx_uarte_tx(...)                  0
    #define nrfx_uarte_tx_in_progress(...)      0
    #define nrfx_uarte_tx_abort(...)
    #define nrfx_uarte_rx(...)                  0
    #define nrfx_uarte_rx_ready(...)            0
    #define nrfx_uarte_rx_abort(...)
    #define nrfx_uarte_errorsrc_get(...)        0
    #define NRF_DRV_UART_CREATE_UARTE(id)
#endif

// Mbed - needed to build
#define NRF_DRV_UART_WITH_UART
#if defined(NRF_DRV_UART_WITH_UART)
    #include <nrfx_uart.h>
    #define NRF_DRV_UART_CREATE_UART(id) \
        .uart = NRFX_UART_INSTANCE(id),
#else
    // Compilers (at least the smart ones) will remove the UART related code
    // (blocks starting with "if (NRF_DRV_UART_USE_UART)") when it is not used,
    // but to perform the compilation they need the following definitions.
    #define nrfx_uart_init(...)                 0
    #define nrfx_uart_uninit(...)
    #define nrfx_uart_task_address_get(...)     0
    #define nrfx_uart_event_address_get(...)    0
    #define nrfx_uart_tx(...)                   0
    #define nrfx_uart_tx_in_progress(...)       0
    #define nrfx_uart_tx_abort(...)
    #define nrfx_uart_rx(...)                   0
    #define nrfx_uart_rx_enable(...)
    #define nrfx_uart_rx_disable(...)
    #define nrfx_uart_rx_ready(...)             0
    #define nrfx_uart_rx_abort(...)
    #define nrfx_uart_errorsrc_get(...)         0
    #define NRF_DRV_UART_CREATE_UART(id)

    // This part is for old modules that use directly UART HAL definitions
    // (to make them compilable for chips that have only UARTE).
    #define NRF_UART_BAUDRATE_1200      NRF_UARTE_BAUDRATE_1200
    #define NRF_UART_BAUDRATE_2400      NRF_UARTE_BAUDRATE_2400
    #define NRF_UART_BAUDRATE_4800      NRF_UARTE_BAUDRATE_4800
    #define NRF_UART_BAUDRATE_9600      NRF_UARTE_BAUDRATE_9600
    #define NRF_UART_BAUDRATE_14400     NRF_UARTE_BAUDRATE_14400
    #define NRF_UART_BAUDRATE_19200     NRF_UARTE_BAUDRATE_19200
    #define NRF_UART_BAUDRATE_28800     NRF_UARTE_BAUDRATE_28800
    #define NRF_UART_BAUDRATE_38400     NRF_UARTE_BAUDRATE_38400
    #define NRF_UART_BAUDRATE_57600     NRF_UARTE_BAUDRATE_57600
    #define NRF_UART_BAUDRATE_76800     NRF_UARTE_BAUDRATE_76800
    #define NRF_UART_BAUDRATE_115200    NRF_UARTE_BAUDRATE_115200
    #define NRF_UART_BAUDRATE_230400    NRF_UARTE_BAUDRATE_230400
    #define NRF_UART_BAUDRATE_250000    NRF_UARTE_BAUDRATE_250000
    #define NRF_UART_BAUDRATE_460800    NRF_UARTE_BAUDRATE_460800
    #define NRF_UART_BAUDRATE_921600    NRF_UARTE_BAUDRATE_921600
    #define NRF_UART_BAUDRATE_1000000   NRF_UARTE_BAUDRATE_1000000
    typedef nrf_uarte_baudrate_t        nrf_uart_baudrate_t;
    #define NRF_UART_ERROR_OVERRUN_MASK NRF_UARTE_ERROR_OVERRUN_MASK
    #define NRF_UART_ERROR_PARITY_MASK  NRF_UARTE_ERROR_PARITY_MASK
    #define NRF_UART_ERROR_FRAMING_MASK NRF_UARTE_ERROR_PARITY_MASK
    #define NRF_UART_ERROR_BREAK_MASK   NRF_UARTE_ERROR_BREAK_MASK
    typedef nrf_uarte_error_mask_t      nrf_uart_error_mask_t;
    #define NRF_UART_HWFC_DISABLED      NRF_UARTE_HWFC_DISABLED
    #define NRF_UART_HWFC_ENABLED       NRF_UARTE_HWFC_ENABLED
    typedef nrf_uarte_hwfc_t            nrf_uart_hwfc_t;
    #define NRF_UART_PARITY_EXCLUDED    NRF_UARTE_PARITY_EXCLUDED
    #define NRF_UART_PARITY_INCLUDED    NRF_UARTE_PARITY_INCLUDED
    typedef nrf_uarte_parity_t          nrf_uart_parity_t;
    typedef nrf_uarte_task_t            nrf_uart_task_t;
    typedef nrf_uarte_event_t           nrf_uart_event_t;
    #define NRF_UART_PSEL_DISCONNECTED  NRF_UARTE_PSEL_DISCONNECTED
    #define nrf_uart_event_clear(...)
#endif

#ifdef __cplusplus
extern "C" {
#endif

/**
 * @defgroup nrf_drv_uart UART driver - legacy layer
 * @{
 * @ingroup  nrf_uart
 * @brief    Layer providing compatibility with the former API.
 */

/**
 * @brief Structure for the UART driver instance.
 */
typedef struct
{
    uint8_t inst_idx;
#if defined(NRF_DRV_UART_WITH_UARTE)
    nrfx_uarte_t uarte;
#endif
#if defined(NRF_DRV_UART_WITH_UART)
    nrfx_uart_t uart;
#endif
} nrf_drv_uart_t;

/**
 * @brief Macro for creating an UART driver instance.
 */
#define NRF_DRV_UART_INSTANCE(id) \
{                                 \
    .inst_idx = id,               \
    NRF_DRV_UART_CREATE_UARTE(id) \
    NRF_DRV_UART_CREATE_UART(id)  \
}

/**
 * @brief Types of UART driver events.
 */
typedef enum
{
    NRF_DRV_UART_EVT_TX_DONE, ///< Requested TX transfer completed.
    NRF_DRV_UART_EVT_RX_DONE, ///< Requested RX transfer completed.
    NRF_DRV_UART_EVT_ERROR,   ///< Error reported by UART peripheral.
} nrf_drv_uart_evt_type_t;

